# SQL Project

In this project we are to create a database which we will query on in part two of the project. We are going to use SQL (Structured Query Language) which  is a standard language for storing, manipulating and retrieving data in databases.

#### Import Libraries

In [15]:
import pandas as pd
import psycopg2
import sqlalchemy

from sqlalchemy import create_engine

In [16]:
conn = psycopg2.connect("dbname=Umuzi user=user password=pass host=localhost")

OperationalError: FATAL:  password authentication failed for user "user"
FATAL:  password authentication failed for user "user"

# Part 1: Creating a database

## Creating Tables

### Customer Table

In [92]:

# CREATE TABLE CustomersTable(
# CustomerID SERIAL PRIMARY KEY,
# FirstName varchar (50),
# LastName varchar (50),
# Gender varchar,Address varchar(200),
# Phone bigint,
# Email varchar (100),City varchar (20),
# Country varchar (50)
# );

### Employees Table

In [93]:
# CREATE TABLE EmployeesTable(
# EmployeeID SERIAL PRIMARY KEY,
# FirstName varchar (50),LastName varchar (50),
# Email varchar (100),
# JobTitle varchar (20)
# );

### Products Table

In [ ]:
# CREATE TABLE ProductsTable(
# ProductID SERIAL PRIMARY KEY,
# ProductName varchar (100),
# Description varchar (300),
# BuyPrice decimal
# );

### Payments Table

In [ ]:
# CREATE TABLE PaymentsTable(
# CustomerId bigint,
# PaymentID SERIAL PRIMARY KEY,
# PaymentDate date,
# Amount decimal,
# FOREIGN KEY (CustomerId) REFERENCES CustomersTable(CustomerId)
# );

### Orders Table

In [ ]:
# CREATE TABLE OrdersTable(
# OrderId SERIAL PRIMARY KEY,
# ProductID bigint,
# PaymentID bigint,
# FulfilledByEmployeeID bigint,
# DateRequired date,
# DateShipped date,
# Status varchar (20),
# FOREIGN KEY (ProductID) REFERENCES ProductsTable(ProductID),
# FOREIGN KEY (PaymentID) REFERENCES PaymentsTable(PaymentID),
# FOREIGN KEY (FulfilledByEmployeeID) REFERENCES EmployeesTable(EmployeeID)
# );

## Inserting Data to the tables.

#### FOR CUSTOMER TABLE

In [94]:
# INSERT INTO CustomersTable(CustomerID, FirstName, LastName, Gender, Address, Phone, Email, City, Country)
# VALUES (1, 'John', 'Hibert', 'Male', '284 chaucer st', 084789657, 'john@gmail.com', 'Johannesburg', 'South Africa');

# INSERT INTO CustomersTable(CustomerID, FirstName, LastName, Gender, Address, Phone, Email, City, Country)
# VALUES (2, 'Thando', 'Sithole', 'Female', '240 Sect 1', 0794445584, 'thando@gmail.com', 'Cape Town', 'South Africa');

# INSERT INTO CustomersTable(CustomerID, FirstName, LastName, Gender, Address, Phone, Email, City, Country)
# VALUES (3, 'Leon', 'Glen', 'Male', '81 Everton Rd Gillits', 0820832830, 'Leon@gmail.com', 'Durban', 'South Africa');

# INSERT INTO CustomersTable(CustomerID, FirstName, LastName, Gender, Address, Phone, Email, City, Country)
# VALUES (4, 'Charl', 'Muller', 'Male', '290A Dorset Ecke', 44856872553, 'Charl.muller@yahoo.com', 'Berlin', 'Germany');

# INSERT INTO CustomersTable(CustomerID, FirstName, LastName, Gender, Address, Phone, Email, City, Country)
# VALUES (5, 'Julia', 'Stein', 'Female', '2 Wernerring', 448672445058, 'Js234@yahoo.com', 'Frankfurt', 'Germany');

#### FOR EMPLOYEE TABLE

In [ ]:
# INSERT INTO EmployeesTable(EmployeeID ,FirstName ,LastName,Email ,JobTitle)
# VALUES (1, 'Kani', 'Matthew', 'mat@gmail.com', 'Manager');

# INSERT INTO EmployeesTable(EmployeeID ,FirstName ,LastName ,Email ,JobTitle)
# VALUES (2, 'Lesly', 'Cronje', 'LesC@gmail.com', 'Clerk');

# INSERT INTO EmployeesTable(EmployeeID ,FirstName ,LastName ,Email ,JobTitle)
# VALUES (3, 'Gideon', 'Maduku', 'm@gmail.com','Accountant');

#### FOR PRODUCTS TABLE

In [ ]:
# INSERT INTO ProductsTable(ProductID, ProductName, Description, BuyPrice)
# VALUES (1, 'Harley Davidson Chopper', 'This replica features working kickstand, front suspension, gear-shift lever', 150.75);

# INSERT INTO ProductsTable(ProductID, ProductName, Description, BuyPrice)
# VALUES (2, 'Classic Car', 'Turnable front wheels, steering function', 550.75);

# INSERT INTO ProductsTable(ProductID, ProductName, Description, BuyPrice)
# VALUES (3, 'Sports car', 'Turnable front wheels, steering function', 700.60);

#### FOR PAYMENTS TABLE

In [ ]:
# INSERT INTO PaymentsTable (CustomerId, PaymentID, PaymentDate, Amount)
# VALUES (1, 1, '2018-09-01', 150.75);

# INSERT INTO PaymentsTable (CustomerId, PaymentID, PaymentDate, Amount)
# VALUES (5, 2, '2018-09-03', 150.75);

# INSERT INTO PaymentsTable (CustomerId, PaymentID, PaymentDate, Amount)
# VALUES (4, 3, '2018-09-03', 700.60);

#### FOR ORDERS TABLE

In [97]:
# INSERT INTO OrdersTable(OrderId, ProductID, PaymentID, FulfilledByEmployeeID, DateRequired, DateShipped, Status)
# VALUES (1, 1, 1, 2, '2018-09-05', Null, 'Not shipped');

# INSERT INTO OrdersTable(OrderId, ProductID, PaymentID, FulfilledByEmployeeID, DateRequired, DateShipped, Status)
# VALUES (2, 1, 2, 2, '2018-09-04', '2018-09-03', 'Shipped');

# INSERT INTO OrdersTable(OrderId, ProductID, PaymentID, FulfilledByEmployeeID, DateRequired, DateShipped, Status)
# VALUES (3, 3, 3, 3, '2018-09-06', Null,'Not shipped');

# Part 2: Querying a database

1.All records

In [17]:
SELECT * from CustomersTable;

2.Name column

In [18]:
SELECT FirstName, LastName from CustomersTable;

3.CustomerID = 1

In [ ]:
SELECT FirstName, LastName FROM CustomersTable WHERE CustomerId = 1;

4.Update Lerato Mabitso

In [ ]:
UPDATE CustomersTable SET FirstName = Lerato, LastName = Mabitso WHERE CustomerID = 1;

5.Delete

In [ ]:
DELETE FROM CustomersTable WHERE CustomerID = 2;

6.Unique

In [ ]:
SELECT Distinct Status From OrdersTable;

7.Return

In [ ]:
SELECT MAX(Amount) AS LargestPayment FROM PaymentsTable;

8.Sort Country

In [ ]:
SELECT FirstName, LastName FROM CustomersTable ORDER BY Country ASC;

9.Price range R100 - R600

In [ ]:
SELECT * FROM ProductsTable WHERE BuyPrice BETWEEN 100 and 600;

10.Germany & Berlin

In [ ]:
SELECT * FROM Customers WHERE Country = 'Germany' and City = 'Berlin';

11.Cape Town or Durban

In [ ]:
SELECT * FROM CustomersTable WHERE City= 'Cape town' OR City='Durban';

12.Price range R500>

In [ ]:
SELECT * FROM ProductsTable WHERE BuyPrice > 500;

13.Sum of payments

In [ ]:
SELECT SUM(Amount) FROM PaymentsTable;

14.Number of orders

In [ ]:
SELECT COUNT(Status) FROM OrdersTable WHERE status = 'Shipped';

15.Average price

In [ ]:
SELECT AVG(BuyPrice/12) AS  AverageDollars, AVG(BuyPrice) AS  AverageRand FROM ProductsTable;

16.Inner Join

In [ ]:
SELECT * FROM CustomersTable INNER JOIN PaymentsTable ON PaymentsTable.CustomerID = CustomersTable.CustomerID;

17.Turnable Front Wheels

In [ ]:
SELECT * FROM ProductsTable WHERE description = 'Turnable front wheels, steering function'